Masmiseim36/nxpSDK/boards/mimxrt700evk/driver_examples/mmu/xspi/cm33_core0/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v16.0
processor: MIMXRT798S
package_id: MIMXRT798SGFOA
mcu_data: ksdk2_0
processor_version: 0.2412.10
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: N4, peripheral: LP_FLEXCOMM0, signal: P0, pin_signal: PIO0_31/LP_FLEXCOMM0_P0/UTICK0_CAP2/SCT0_OUT8/CTIMER4_MAT0, input_buffer: enable}
  - {pin_num: N5, peripheral: LP_FLEXCOMM0, signal: P1, pin_signal: PIO1_0/LP_FLEXCOMM0_P1/SCT0_OUT9/CTIMER4_MAT1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t port0_pin31_config = (/* Pin is configured as LP_FLEXCOMM0_P0 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN31 (coords: N4) is configured as LP_FLEXCOMM0_P0 */
    IOPCTL_PinMuxSet(0U, 31U, port0_pin31_config);

    const uint32_t port1_pin0_config = (/* Pin is configured as LP_FLEXCOMM0_P1 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN0 (coords: N5) is configured as LP_FLEXCOMM0_P1 */
    IOPCTL_PinMuxSet(1U, 0U, port1_pin0_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPsRamPins_Xspi1:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: H17, peripheral: XSPI1, signal: 'DATA, 0', pin_signal: PIO5_1/XSPI1_DATA0/LP_FLEXCOMM13_P5, input_buffer: enable}
  - {pin_num: H18, peripheral: XSPI1, signal: 'DATA, 1', pin_signal: PIO5_2/XSPI1_DATA1/LP_FLEXCOMM13_P6, input_buffer: enable}
  - {pin_num: F18, peripheral: XSPI1, signal: 'DATA, 2', pin_signal: PIO5_3/XSPI1_DATA2/LP_FLEXCOMM13_P0, input_buffer: enable}
  - {pin_num: F16, peripheral: XSPI1, signal: 'DATA, 3', pin_signal: PIO5_4/XSPI1_DATA3/LP_FLEXCOMM13_P1, input_buffer: enable}
  - {pin_num: E16, peripheral: XSPI1, signal: 'DATA, 4', pin_signal: PIO5_6/XSPI1_DATA4/LP_FLEXCOMM12_P3, input_buffer: enable}
  - {pin_num: K16, peripheral: XSPI1, signal: 'DATA, 5', pin_signal: PIO5_7/XSPI1_DATA5/LP_FLEXCOMM12_P0, input_buffer: enable}
  - {pin_num: H16, peripheral: XSPI1, signal: 'DATA, 6', pin_signal: PIO5_8/XSPI1_DATA6/LP_FLEXCOMM12_P1, input_buffer: enable}
  - {pin_num: J16, peripheral: XSPI1, signal: 'DATA, 7', pin_signal: PIO5_9/XSPI1_DATA7/LP_FLEXCOMM12_P2, input_buffer: enable}
  - {pin_num: H13, peripheral: XSPI1, signal: SS0_N, pin_signal: PIO5_0/XSPI1_SS0_N/LP_FLEXCOMM13_P4, input_buffer: enable}
  - {pin_num: G16, peripheral: XSPI1, signal: DQS0, pin_signal: PIO5_5/XSPI1_DQS0/LP_FLEXCOMM13_P2, input_buffer: enable, pull_select: down, pull_enable: enable}
  - {pin_num: J15, peripheral: XSPI1, signal: DQS1, pin_signal: PIO5_16/XSPI1_DQS1/LP_FLEXCOMM11_P2, input_buffer: enable}
  - {pin_num: F17, peripheral: XSPI1, signal: SCLK0, pin_signal: PIO5_10/XSPI1_SCLK0/LP_FLEXCOMM13_P3, input_buffer: enable}
  - {pin_num: G17, peripheral: XSPI1, signal: SCLK0_N, pin_signal: PIO5_11/XSPI1_SCLK0_N/LP_FLEXCOMM12_P4/XSPI1_SS1_N, input_buffer: enable}
  - {pin_num: K15, peripheral: XSPI1, signal: 'DATA, 8', pin_signal: PIO5_12/XSPI1_DATA8/LP_FLEXCOMM12_P5, input_buffer: enable}
  - {pin_num: H15, peripheral: XSPI1, signal: 'DATA, 9', pin_signal: PIO5_13/XSPI1_DATA9/LP_FLEXCOMM12_P6, input_buffer: enable}
  - {pin_num: M13, peripheral: XSPI1, signal: 'DATA, 10', pin_signal: PIO5_14/XSPI1_DATA10/LP_FLEXCOMM11_P0, input_buffer: enable}
  - {pin_num: J14, peripheral: XSPI1, signal: 'DATA, 11', pin_signal: PIO5_15/XSPI1_DATA11/LP_FLEXCOMM11_P1, input_buffer: enable}
  - {pin_num: K13, peripheral: XSPI1, signal: 'DATA, 12', pin_signal: PIO5_17/XSPI1_DATA12/LP_FLEXCOMM11_P3, input_buffer: enable}
  - {pin_num: H14, peripheral: XSPI1, signal: 'DATA, 13', pin_signal: PIO5_18/XSPI1_DATA13/LP_FLEXCOMM11_P4, input_buffer: enable}
  - {pin_num: L13, peripheral: XSPI1, signal: 'DATA, 14', pin_signal: PIO5_19/XSPI1_DATA14/LP_FLEXCOMM11_P5, input_buffer: enable}
  - {pin_num: K14, peripheral: XSPI1, signal: 'DATA, 15', pin_signal: PIO5_20/XSPI1_DATA15/LP_FLEXCOMM11_P6, input_buffer: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

